zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxSdmmc_bf.h
/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.CARD_STABLE */
#define IFX_SDMMC_PSTATE_REG_CARD_STABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.CARD_STABLE */
#define IFX_SDMMC_PSTATE_REG_CARD_STABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.CARD_STABLE */
#define IFX_SDMMC_PSTATE_REG_CARD_STABLE_OFF (17u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.CARD_DETECT_LEVEL */
#define IFX_SDMMC_PSTATE_REG_CARD_DETECT_LEVEL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.CARD_DETECT_LEVEL */
#define IFX_SDMMC_PSTATE_REG_CARD_DETECT_LEVEL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.CARD_DETECT_LEVEL */
#define IFX_SDMMC_PSTATE_REG_CARD_DETECT_LEVEL_OFF (18u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.WR_PROTECT_SW_LVL */
#define IFX_SDMMC_PSTATE_REG_WR_PROTECT_SW_LVL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.WR_PROTECT_SW_LVL */
#define IFX_SDMMC_PSTATE_REG_WR_PROTECT_SW_LVL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.WR_PROTECT_SW_LVL */
#define IFX_SDMMC_PSTATE_REG_WR_PROTECT_SW_LVL_OFF (19u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.DAT_3_0 */
#define IFX_SDMMC_PSTATE_REG_DAT_3_0_LEN (4u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.DAT_3_0 */
#define IFX_SDMMC_PSTATE_REG_DAT_3_0_MSK (0xfu)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.DAT_3_0 */
#define IFX_SDMMC_PSTATE_REG_DAT_3_0_OFF (20u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.CMD_LINE_LVL */
#define IFX_SDMMC_PSTATE_REG_CMD_LINE_LVL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.CMD_LINE_LVL */
#define IFX_SDMMC_PSTATE_REG_CMD_LINE_LVL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.CMD_LINE_LVL */
#define IFX_SDMMC_PSTATE_REG_CMD_LINE_LVL_OFF (24u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.HOST_REG_VOL */
#define IFX_SDMMC_PSTATE_REG_HOST_REG_VOL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.HOST_REG_VOL */
#define IFX_SDMMC_PSTATE_REG_HOST_REG_VOL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.HOST_REG_VOL */
#define IFX_SDMMC_PSTATE_REG_HOST_REG_VOL_OFF (25u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.CMD_ISSUE_ERR */
#define IFX_SDMMC_PSTATE_REG_CMD_ISSUE_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.CMD_ISSUE_ERR */
#define IFX_SDMMC_PSTATE_REG_CMD_ISSUE_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.CMD_ISSUE_ERR */
#define IFX_SDMMC_PSTATE_REG_CMD_ISSUE_ERR_OFF (27u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.SUB_CMD_STAT */
#define IFX_SDMMC_PSTATE_REG_SUB_CMD_STAT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.SUB_CMD_STAT */
#define IFX_SDMMC_PSTATE_REG_SUB_CMD_STAT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.SUB_CMD_STAT */
#define IFX_SDMMC_PSTATE_REG_SUB_CMD_STAT_OFF (28u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.IN_DORMANT_ST */
#define IFX_SDMMC_PSTATE_REG_IN_DORMANT_ST_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.IN_DORMANT_ST */
#define IFX_SDMMC_PSTATE_REG_IN_DORMANT_ST_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.IN_DORMANT_ST */
#define IFX_SDMMC_PSTATE_REG_IN_DORMANT_ST_OFF (29u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.LANE_SYNC */
#define IFX_SDMMC_PSTATE_REG_LANE_SYNC_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.LANE_SYNC */
#define IFX_SDMMC_PSTATE_REG_LANE_SYNC_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.LANE_SYNC */
#define IFX_SDMMC_PSTATE_REG_LANE_SYNC_OFF (30u)

/** \brief Length for Ifx_SDMMC_PSTATE_REG_Bits.UHS2_IF_DETECT */
#define IFX_SDMMC_PSTATE_REG_UHS2_IF_DETECT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PSTATE_REG_Bits.UHS2_IF_DETECT */
#define IFX_SDMMC_PSTATE_REG_UHS2_IF_DETECT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PSTATE_REG_Bits.UHS2_IF_DETECT */
#define IFX_SDMMC_PSTATE_REG_UHS2_IF_DETECT_OFF (31u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL1_Bits.LED_CTRL */
#define IFX_SDMMC_HOST_CTRL1_LED_CTRL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL1_Bits.LED_CTRL */
#define IFX_SDMMC_HOST_CTRL1_LED_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL1_Bits.LED_CTRL */
#define IFX_SDMMC_HOST_CTRL1_LED_CTRL_OFF (0u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL1_Bits.DAT_XFER_WIDTH */
#define IFX_SDMMC_HOST_CTRL1_DAT_XFER_WIDTH_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL1_Bits.DAT_XFER_WIDTH */
#define IFX_SDMMC_HOST_CTRL1_DAT_XFER_WIDTH_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL1_Bits.DAT_XFER_WIDTH */
#define IFX_SDMMC_HOST_CTRL1_DAT_XFER_WIDTH_OFF (1u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL1_Bits.HIGH_SPEED_EN */
#define IFX_SDMMC_HOST_CTRL1_HIGH_SPEED_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL1_Bits.HIGH_SPEED_EN */
#define IFX_SDMMC_HOST_CTRL1_HIGH_SPEED_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL1_Bits.HIGH_SPEED_EN */
#define IFX_SDMMC_HOST_CTRL1_HIGH_SPEED_EN_OFF (2u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL1_Bits.DMA_SEL */
#define IFX_SDMMC_HOST_CTRL1_DMA_SEL_LEN (2u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL1_Bits.DMA_SEL */
#define IFX_SDMMC_HOST_CTRL1_DMA_SEL_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL1_Bits.DMA_SEL */
#define IFX_SDMMC_HOST_CTRL1_DMA_SEL_OFF (3u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL1_Bits.EXT_DAT_XFER */
#define IFX_SDMMC_HOST_CTRL1_EXT_DAT_XFER_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL1_Bits.EXT_DAT_XFER */
#define IFX_SDMMC_HOST_CTRL1_EXT_DAT_XFER_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL1_Bits.EXT_DAT_XFER */
#define IFX_SDMMC_HOST_CTRL1_EXT_DAT_XFER_OFF (5u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL1_Bits.CARD_DETECT_TEST_LVL */
#define IFX_SDMMC_HOST_CTRL1_CARD_DETECT_TEST_LVL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL1_Bits.CARD_DETECT_TEST_LVL */
#define IFX_SDMMC_HOST_CTRL1_CARD_DETECT_TEST_LVL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL1_Bits.CARD_DETECT_TEST_LVL */
#define IFX_SDMMC_HOST_CTRL1_CARD_DETECT_TEST_LVL_OFF (6u)

/** \brief Length for Ifx_SDMMC_HOST_CTRL1_Bits.CARD_DETECT_SIG_LVL */
#define IFX_SDMMC_HOST_CTRL1_CARD_DETECT_SIG_LVL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_HOST_CTRL1_Bits.CARD_DETECT_SIG_LVL */
#define IFX_SDMMC_HOST_CTRL1_CARD_DETECT_SIG_LVL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_HOST_CTRL1_Bits.CARD_DETECT_SIG_LVL */
#define IFX_SDMMC_HOST_CTRL1_CARD_DETECT_SIG_LVL_OFF (7u)

