zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxSdmmc_bf.h
/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_AUTO_CMD_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_AUTO_CMD_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_AUTO_CMD_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_AUTO_CMD_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_AUTO_CMD_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_AUTO_CMD_ERR_OFF (8u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_ADMA_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_ADMA_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_ADMA_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_ADMA_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_ADMA_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_ADMA_ERR_OFF (9u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_TUNING_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_TUNING_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_TUNING_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_TUNING_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_TUNING_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_TUNING_ERR_OFF (10u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_RESP_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_RESP_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_RESP_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_RESP_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_RESP_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_RESP_ERR_OFF (11u)

/** \brief Length for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_BOOT_ACK_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_BOOT_ACK_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_BOOT_ACK_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_BOOT_ACK_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits.FORCE_BOOT_ACK_ERR */
#define IFX_SDMMC_FORCE_ERROR_INT_STAT_FORCE_BOOT_ACK_ERR_OFF (12u)

/** \brief Length for Ifx_SDMMC_ADMA_ERR_STAT_Bits.ADMA_ERR_STATES */
#define IFX_SDMMC_ADMA_ERR_STAT_ADMA_ERR_STATES_LEN (2u)

/** \brief Mask for Ifx_SDMMC_ADMA_ERR_STAT_Bits.ADMA_ERR_STATES */
#define IFX_SDMMC_ADMA_ERR_STAT_ADMA_ERR_STATES_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_ADMA_ERR_STAT_Bits.ADMA_ERR_STATES */
#define IFX_SDMMC_ADMA_ERR_STAT_ADMA_ERR_STATES_OFF (0u)

/** \brief Length for Ifx_SDMMC_ADMA_ERR_STAT_Bits.ADMA_LEN_ERR */
#define IFX_SDMMC_ADMA_ERR_STAT_ADMA_LEN_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ADMA_ERR_STAT_Bits.ADMA_LEN_ERR */
#define IFX_SDMMC_ADMA_ERR_STAT_ADMA_LEN_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ADMA_ERR_STAT_Bits.ADMA_LEN_ERR */
#define IFX_SDMMC_ADMA_ERR_STAT_ADMA_LEN_ERR_OFF (2u)

/** \brief Length for Ifx_SDMMC_ADMA_SA_LOW_Bits.ADMA_SA_LOW */
#define IFX_SDMMC_ADMA_SA_LOW_ADMA_SA_LOW_LEN (32u)

/** \brief Mask for Ifx_SDMMC_ADMA_SA_LOW_Bits.ADMA_SA_LOW */
#define IFX_SDMMC_ADMA_SA_LOW_ADMA_SA_LOW_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_ADMA_SA_LOW_Bits.ADMA_SA_LOW */
#define IFX_SDMMC_ADMA_SA_LOW_ADMA_SA_LOW_OFF (0u)

/** \brief Length for Ifx_SDMMC_PRESET_INIT_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_FREQ_SEL_VAL_LEN (10u)

/** \brief Mask for Ifx_SDMMC_PRESET_INIT_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_FREQ_SEL_VAL_MSK (0x3ffu)

/** \brief Offset for Ifx_SDMMC_PRESET_INIT_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_FREQ_SEL_VAL_OFF (0u)

/** \brief Length for Ifx_SDMMC_PRESET_INIT_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_CLK_GEN_SEL_VAL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PRESET_INIT_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_CLK_GEN_SEL_VAL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PRESET_INIT_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_CLK_GEN_SEL_VAL_OFF (10u)

/** \brief Length for Ifx_SDMMC_PRESET_INIT_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_DRV_SEL_VAL_LEN (2u)

/** \brief Mask for Ifx_SDMMC_PRESET_INIT_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_DRV_SEL_VAL_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_PRESET_INIT_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_INIT_DRV_SEL_VAL_OFF (14u)

/** \brief Length for Ifx_SDMMC_PRESET_DS_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_FREQ_SEL_VAL_LEN (10u)

/** \brief Mask for Ifx_SDMMC_PRESET_DS_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_FREQ_SEL_VAL_MSK (0x3ffu)

/** \brief Offset for Ifx_SDMMC_PRESET_DS_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_FREQ_SEL_VAL_OFF (0u)

/** \brief Length for Ifx_SDMMC_PRESET_DS_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_CLK_GEN_SEL_VAL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PRESET_DS_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_CLK_GEN_SEL_VAL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PRESET_DS_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_CLK_GEN_SEL_VAL_OFF (10u)

/** \brief Length for Ifx_SDMMC_PRESET_DS_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_DRV_SEL_VAL_LEN (2u)

/** \brief Mask for Ifx_SDMMC_PRESET_DS_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_DRV_SEL_VAL_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_PRESET_DS_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_DS_DRV_SEL_VAL_OFF (14u)

/** \brief Length for Ifx_SDMMC_PRESET_HS_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_FREQ_SEL_VAL_LEN (10u)

/** \brief Mask for Ifx_SDMMC_PRESET_HS_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_FREQ_SEL_VAL_MSK (0x3ffu)

/** \brief Offset for Ifx_SDMMC_PRESET_HS_Bits.FREQ_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_FREQ_SEL_VAL_OFF (0u)

/** \brief Length for Ifx_SDMMC_PRESET_HS_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_CLK_GEN_SEL_VAL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_PRESET_HS_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_CLK_GEN_SEL_VAL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_PRESET_HS_Bits.CLK_GEN_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_CLK_GEN_SEL_VAL_OFF (10u)

/** \brief Length for Ifx_SDMMC_PRESET_HS_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_DRV_SEL_VAL_LEN (2u)

/** \brief Mask for Ifx_SDMMC_PRESET_HS_Bits.DRV_SEL_VAL */
#define IFX_SDMMC_PRESET_HS_DRV_SEL_VAL_MSK (0x3u)

